[{"title":"三月十三，你的生日","date":"2017-03-13T15:06:59.000Z","path":"2017/03/13/20170313/","text":"1. 工作发现自己不爱提问这毛病真的蛮蛋疼，自己瞎懵半天，没什么成果，其实挺简单的一个问题，好好问问就会豁然开朗了。这个毛病必须改，要不然不会有进步，没什么不好问的，大家都很热心，职业生涯一开始遇到这样的带路人，也是很幸运的一件事。然后有感觉到自主思考能力的进步。没去及时提问，一个小小的原因是想自己思考出来，结果一想就。。没了，奈何知识储备不够，搞得自己头昏脑胀。不过这也算积极的反馈吧，多想多思考总不是坏事。然后工作遇到问题虽然心情有点压抑，但是这样的压抑来再多都不怕甚至希望能经常压抑压抑。因为这代表着进步啊，哈哈。最后还是很懒，有时间不想着多学点东西，就知道玩手机== 2. 生活今天是一个特殊的日子，今天就感觉像过年啊朋友们。什么日子，你的生日。昨晚11点半开始坐床上用手机码字，有些想说的话，写了一堆有的没的，写到零点。然后赶紧去给你发消息祝生日快乐，结果你睡了。。。多的我也懒得想，在这方面，能不想事就不想。码了半个小时的字也没想给你看，嘿嘿，说不定就没了。认识六年半咯，6年啦，好长。才6年，远远不够。等下一个6年，十年，看看会发生什么吧。感情这回事，最不怕的，就是卑微。最不缺的，就是心甘情愿。我等着最后的结果，无论何时来临。","tags":[{"name":"life is what u can't get","slug":"life-is-what-u-can-t-get","permalink":"http://yoursite.com/tags/life-is-what-u-can-t-get/"}]},{"title":"2017.3.9每日总结","date":"2017-03-09T12:09:19.000Z","path":"2017/03/09/2017-3-9每日总结/","text":"1. 今日工作相关 今天完成了注册界面的数据通信，对整体流程更加熟悉。这是一个好现象。但是不足的地方依旧很多，慢慢来吧，胖子不是一日养成的，我要变胖~ 然后，对后台工作逻辑有了一定的熟悉，另一种思维吧。没事还是要多思考，想着想着就(￣︶￣)↗ 涨姿势了。 工作进度。有点慢，月底就要回学校了，时间很紧迫，要时刻提醒自己，提升专注度，加快进度，争取在回校之前完成自己的全部任务。 2. 其他 今天向文彬哥和淑君说了请假的事，其实请2个月我也有点不好意思，但是谁让我们这一届总是遇上第一次，第一次中期答辩，没办法。哇说起这个就想到毕业设计还没怎么动，下个月的这个时候就中期答辩了，好慌。。 给山大王买生日礼物被拒绝了，本来是想我买我的不管，但是想了想，怕她不开心。。算了。 然后，凭我语文满级的水平，还是看不懂那段话，有点伤啊，有点伤，欺负我缺乏艺术细胞是吧。 最后，由于不带电脑回宿舍，文章现在在公司发了，带本书回去看。本来想用手机刷慕课网，一想到那个网速。。 over，good night。","tags":[{"name":"work","slug":"work","permalink":"http://yoursite.com/tags/work/"}]},{"title":"今日总结","date":"2017-03-08T14:44:26.000Z","path":"2017/03/08/今日总结/","text":"随着工作的深入，越来越发现自己的不足，无论是从经验上还是从技术上。必须要抓紧时间提升自己水平。今天除了界面的部署，在和后台通信方面寸步难行。对于公司框架的不熟悉，对于请求数据的不熟悉，多种“新知识”同时灌过来，好容易被呛死。加上后台的接口也不对，整个人都是懵逼的。唯一的欣慰在于不只是感受到了自己的不足，更清楚感受到了进步的空间和过程，这点很开心。 这些天写的文章都是灌水瞎扯淡，因为没什么时间去写技术性的。这个周末吧，也不打算出去透透气了，睡个懒觉起来学点东西，写点文章。学习真的能让人感觉到快乐。不知道什么时候会有那份心去多看点书，非技术的。拖延癌晚期的我。加油吧。 希望明天顺利完成自己的工作，多问多想多做。还有，不要失眠睡不着。","tags":[{"name":"work","slug":"work","permalink":"http://yoursite.com/tags/work/"}]},{"title":"此时此刻","date":"2017-03-07T15:39:23.000Z","path":"2017/03/07/此时此刻/","text":"1. 换了个主题 2. 明天添加音乐和favicon 3. 还有三周回学校，心情复杂 4. 失眠第三天 5. 不经意间发现的总是最美最伤人 6. 晚安","tags":[{"name":"life is what u can't get","slug":"life-is-what-u-can-t-get","permalink":"http://yoursite.com/tags/life-is-what-u-can-t-get/"}]},{"title":"每日总结","date":"2017-03-07T11:24:06.000Z","path":"2017/03/07/每日总结/","text":"1 写在前面最近公司任务比较多，随之而来的“疑难杂症”也变多，有点点烦。 2 工作相关 今天做的是注册登录界面的部署，从本地部署到生产环境。怎么说，难度不大，但由于是大姑娘上花轿—头一回，所以还是有点新鲜。 上午还是顺风顺水，一路没什么问题。到了中午快下班的时候，意想不到的问题发生了。由于部署到生产环境要对文件结构进行改动，因此产生了跨模块访问资源的问题，在非公共资源模块的CSS里访问公共资源模块会报错。具体来说是图标字体设置，background:url(),url的路径怎么设置都不对，访问不到。搞了一下午都没解决，后来发现控制台报的是status code:500,组长看了后和我说是服务器的问题。其实一开始也注意到了这个，还去bing了几次，没找到什么有价值的答案，想着会不会是跨域请求的原因。这个问题还是没有解决，明天再看。 上面这个问题衍生出来一个知识点：background和background-iamge的关系，具体来说后者就是前者的细化，可以只用background再加具体属性。推荐这种方式，因为对浏览器比较友好。 3由于最近公司业务较多，博客的升级进度会没那么快，慢慢来吧。但是争取每天一篇文章。","tags":[{"name":"work","slug":"work","permalink":"http://yoursite.com/tags/work/"}]},{"title":"博客待解决问题","date":"2017-03-06T15:25:28.000Z","path":"2017/03/06/博客待解决问题/","text":"折腾了一晚上，还是有一些问题没有解决，记录下来 1左侧栏头像显示问题，在移动端会只显示出上半部分。头像大小也不是原始比例展示。网上的方法有点过时，等明天查查yilia主题官方文档再看。 2个性签名下面有一个小房子图标没有显示出来，留着解决。 3添加网易云音乐，待完成。 4右侧文章只展示概要，待解决。 5添加相册功能 6友情链接 7先就这么多了，有时间慢慢完成。 8favicon 9晚安。","tags":[{"name":"blog","slug":"blog","permalink":"http://yoursite.com/tags/blog/"}]},{"title":"关于这个博客","date":"2017-03-06T13:08:07.000Z","path":"2017/03/06/关于这个博客/","text":"1关于有个博客的想法，是很久很久以前的事情了，那时我还被小伙伴们称为岳阳胡歌。。 2就像我们知道的，开个博客有三种方式。 一是在新浪、简书、博客园等地方直接申请一个，简单又省事。不过这种方式开通的一没有挑战性，第二个收到的限制大，所有没有考虑。 第二是我现在这种，利用github和流行的博客模板做一个，虽然也很傻瓜式，但好歹自由度高点，也有成就感。 第三是自己写一个，自己配置服务器，这种自由度最高也最难。以前也有用node模仿过一个就很简陋的博客，但是由于没有在node上深入了解，后来弃置了。 关于用github做一个，还是室友立娃提供的想法，那是三年前。。然后去年买了一个域名，买完后就懒癌复发，把这事丢到了一边。直到前些天在知乎看到一个hexo+github建博客的教程，心想刚好可以折腾下，给生活添加点新鲜感，于是今天忙(闲)里偷闲，整出来一个。特别容易。不过好歹也是一个博客，希望自己能在这里经常种花种草，记录自己的成长经历，也是蛮有意义的。 3四月份回校尽量在以前的基础上，完成第三种方式的吧，毕竟域名都买了，不用挺可惜的。 4博客还处于起步阶段，我会慢慢把该有的功能都添加上来。","tags":[{"name":"start","slug":"start","permalink":"http://yoursite.com/tags/start/"}]},{"title":"Tc的测试文章","date":"2017-03-06T10:05:16.000Z","path":"2017/03/06/测试文章/","text":"这是一篇测试文章，欢迎关注作者的博客：https://Fun005.github.io**博客","tags":[{"name":"test","slug":"test","permalink":"http://yoursite.com/tags/test/"}]},{"title":"Hello World","date":"2017-03-06T09:49:41.102Z","path":"2017/03/06/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]